# Data Input and Output

- need to know exact location of file to access in pandas.
- you may needs passwords or permisisons for certain data inputs.

In [1]:
import pandas as pd
# We write out the dataframe out to csv

In [2]:
pwd

'C:\\Users\\Alessandro\\Documents\\DataScienceMasterclass\\03-Pandas'

In [3]:
ls

 Volume in drive C has no label.
 Volume Serial Number is AC37-8F77

 Directory of C:\Users\Alessandro\Documents\DataScienceMasterclass\03-Pandas

14/11/2021  09:32 PM    <DIR>          .
14/11/2021  09:32 PM    <DIR>          ..
14/11/2021  09:29 PM    <DIR>          .ipynb_checkpoints
09/11/2021  07:30 PM    <DIR>          __pycache__
11/11/2021  09:56 PM           565,390 00-Series.ipynb
13/11/2021  02:10 PM           208,957 01-DataFrames.ipynb
09/11/2021  07:30 PM           194,591 02-Conditional-Filtering.ipynb
09/11/2021  07:30 PM           196,385 03-Useful-Methods.ipynb
09/11/2021  07:30 PM            64,227 04-Missing-Data.ipynb
09/11/2021  07:30 PM           219,627 05-Groupby-Operations-and-MultiIndex.ipynb
14/11/2021  08:32 PM            62,966 06-Combining-DataFrames.ipynb
09/11/2021  07:30 PM            32,972 07-Text-Methods.ipynb
09/11/2021  07:30 PM            93,392 08-Time-Methods.ipynb
09/11/2021  07:30 PM            65,234 09-Inputs-and-Outputs.ipynb
09/11/2021  07:30 PM           101,081 10-Pivot-Tables.ipynb
09/11/2021  07:30 PM            47,135 11-Pandas-Project-Exercise .ipynb
09/11/2021  07:30 PM            52,576 12-Pandas-Project-Exercise-Solution.ipynb
14/11/2021  08:32 PM            11,457 Concatenation.ipynb
13/11/2021  07:11 PM           112,127 Conditional Filtering.ipynb
14/11/2021  09:32 PM               992 Data Input and Output.ipynb
13/11/2021  05:18 PM           189,763 DataFrames.ipynb
14/11/2021  09:28 PM            26,885 Date and Time Methods.ipynb
14/11/2021  08:32 PM           198,358 DropBy Operations.ipynb
09/11/2021  07:30 PM                51 example.csv
09/11/2021  07:30 PM             5,022 example.xlsx
09/11/2021  07:30 PM        25,112,317 hotel_booking_data.csv
14/11/2021  08:41 PM            34,767 Merging.ipynb
14/11/2021  08:32 PM            46,525 Missing Data.ipynb
09/11/2021  07:30 PM               177 movie_scores.csv
09/11/2021  07:30 PM            17,727 mpg.csv
09/11/2021  07:30 PM             5,022 my_excel_file.xlsx
09/11/2021  07:30 PM                51 new_file.csv
09/11/2021  07:30 PM             5,021 new_workbook.xlsx
09/11/2021  07:30 PM                51 newfile.csv
13/11/2021  02:06 PM            11,102 Pandas Basics.ipynb
09/11/2021  07:30 PM            52,132 reshaping_pivot.png
09/11/2021  07:30 PM             5,459 RetailSales_BeerWineLiquor.csv
09/11/2021  07:30 PM             1,320 Sales_Funnel_CRM.csv
09/11/2021  07:30 PM             1,330 sample_table.html
09/11/2021  07:30 PM               555 simple.html
14/11/2021  08:57 PM            10,263 Text Methods.ipynb
09/11/2021  07:30 PM            18,752 tips.csv
11/11/2021  09:54 PM                72 Untitled.ipynb
13/11/2021  02:08 PM               915 Untitled1.ipynb
14/11/2021  09:28 PM                72 Untitled10.ipynb
13/11/2021  05:19 PM                72 Untitled2.ipynb
13/11/2021  07:11 PM                72 Untitled3.ipynb
13/11/2021  08:17 PM                72 Untitled4.ipynb
14/11/2021  06:21 PM                72 Untitled5.ipynb
14/11/2021  07:01 PM                72 Untitled6.ipynb
14/11/2021  07:16 PM             1,019 Untitled7.ipynb
14/11/2021  08:41 PM                72 Untitled8.ipynb
14/11/2021  08:57 PM                72 Untitled9.ipynb
13/11/2021  08:17 PM           154,220 Useful Methods.ipynb
              50 File(s)     27,928,561 bytes
               4 Dir(s)  1,204,665,958,400 bytes free

In [4]:
# Can us os module in python
import os

In [6]:
os.getcwd() # Probably would be better because it is cross platform

'C:\\Users\\Alessandro\\Documents\\DataScienceMasterclass\\03-Pandas'

In [7]:
os.ls()

AttributeError: module 'os' has no attribute 'ls'

In [9]:
os.dir()

AttributeError: module 'os' has no attribute 'dir'

In [12]:
df = pd.read_csv('example.csv', header=None)

In [13]:
df

    0   1   2   3
0   a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [15]:
df = pd.read_csv('example.csv', index_col=0) # use the first index column as the actual index for the DF

In [16]:
df

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

In [17]:
# To csv and put path!
df.to_csv('newfile.csv')

In [19]:
df = pd.read_csv('example.csv')

In [20]:
df.to_csv('newfile.csv', index=False)

# HTML Tables

In [1]:
# Pandas can convert html table to dataframe.
import pandas as pd

In [2]:
lxml

NameError: name 'lxml' is not defined

In [3]:
# Get all tables out of the html.
tables = pd.read_html('https://en.wikipedia.org/wiki/World_population');

In [5]:
len(tables)

26

In [6]:
tables[0]

        World population (millions, UN estimates)[15]  \
                                                    #
0                                                   1
1                                                   2
2                                                   3
3                                                   4
4                                                   5
5                                                   6
6                                                   7
7                                                   8
8                                                   9
9                                                  10
10                                                NaN
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                      Top ten most populous countries
0                                            China[B]
1                                               India
2                                       United States
3                                           Indonesia
4                                            Pakistan
5                                              Brazil
6                                             Nigeria
7                                          Bangladesh
8                                              Russia
9                                              Mexico
10                                        World total
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                                                 2000
0                                                1270
1                                                1053
2                                                 283
3                                                 212
4                                                 136
5                                                 176
6                                                 123
7                                                 131
8                                                 146
9                                                 103
10                                               6127
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                                                 2015
0                                                1376
1                                                1311
2                                                 322
3                                                 258
4                                                 208
5                                                 206
6                                                 182
7                                                 161
8                                                 146
9                                                 127
10                                               7349
11  Notes: .mw-parser-output .reflist{font-size:90...


                                              2030[A]
0                                                1416
1                                                1528
2                                                 356
3                                                 295
4                                                 245
5                                                 228
6                                                 263
7                                                 186
8                                                 149
9                                                 148
10                                               8501
11  Notes: .mw-parser-output .reflist{font-size:90...

In [7]:
tables[1]

,Continent,Density(inhabitants/km2),Population(millions),Most populous country,Most populous city (metropolitan area)
0,Asia,104.1,4641,"1,439,323,000[note 1] – China","37,393,000/13,929,000 – Greater Tokyo Area/Tok..."
1,Africa,44.4,1340,"0206,139,000 – Nigeria","20,900,000 – Cairo[18]"
2,Europe,73.4,747,"0145,934,000 – Russia;approx. 110 million in E...","16,855,000/12,537,000 – Moscow metropolitan ar..."
3,Latin America,24.1,653,"0212,559,000 – Brazil","22,043,000/12,176,000 – São Paulo Metro Area/S..."
4,Northern America[note 2],14.9,368,"0331,002,000 – United States","23,724,000/8,323,000 – New York metropolitan a..."
5,Oceania,5,42,"0025,499,000 – Australia","4,925,000 – Sydney"
6,Antarctica,~0,0.004[17],N/A[note 3],"1,258 – McMurdo Station"

In [10]:
world_pop_10 = tables[0]

In [12]:
# Get rid of higher level col index
world_pop_10 = world_pop_10['World population (millions, UN estimates)[15]']

In [14]:
world_pop_10

,#,Top ten most populous countries,2000,2015,2030[A]
0,1,China[B],1270,1376,1416
1,2,India,1053,1311,1528
2,3,United States,283,322,356
3,4,Indonesia,212,258,295
4,5,Pakistan,136,208,245
5,6,Brazil,176,206,228
6,7,Nigeria,123,182,263
7,8,Bangladesh,131,161,186
8,9,Russia,146,146,149
9,10,Mexico,103,127,148
10,NaN,World total,6127,7349,8501
11,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...

In [15]:
world_pop_10 = world_pop_10.drop(11, axis=0)

In [16]:
world_pop_10

      # Top ten most populous countries  2000  2015 2030[A]
0     1                        China[B]  1270  1376    1416
1     2                           India  1053  1311    1528
2     3                   United States   283   322     356
3     4                       Indonesia   212   258     295
4     5                        Pakistan   136   208     245
5     6                          Brazil   176   206     228
6     7                         Nigeria   123   182     263
7     8                      Bangladesh   131   161     186
8     9                          Russia   146   146     149
9    10                          Mexico   103   127     148
10  NaN                     World total  6127  7349    8501

In [17]:
world_pop_10 = world_pop_10.drop('#', axis=1)

In [18]:
world_pop_10.columns = ['country', '2000', '2015', '2030']

In [19]:
world_pop_10

          country  2000  2015  2030
0        China[B]  1270  1376  1416
1           India  1053  1311  1528
2   United States   283   322   356
3       Indonesia   212   258   295
4        Pakistan   136   208   245
5          Brazil   176   206   228
6         Nigeria   123   182   263
7      Bangladesh   131   161   186
8          Russia   146   146   149
9          Mexico   103   127   148
10    World total  6127  7349  8501

In [21]:
# Write out to a html.
world_pop_10.to_html('sample_table.html', index=False)

# Excel Files

In [22]:
df = pd.read_excel('my_excel_file.xlsx', sheet_name='First_Sheet')

In [23]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [24]:
# Get list of all sheets.
wb  = pd.ExcelFile('my_excel_file.xlsx')
wb.sheet_names

['First_Sheet']

In [25]:
xlsheetdict = pd.read_excel('my_excel_file.xlsx', sheet_name=None)
xlsheetdict

{'First_Sheet':     a   b   c   d
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15}

In [26]:
xlsheetdict['First_Sheet']

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [28]:
# Write to xl file
# If sheet did already exist then it will be overwritten
df.to_excel('newexcelfile.xlsx', sheet_name='First_Sheet')

# SQL Databases

In [32]:
# Pandas can read in an entire table or sql query right into a dataframe.
from sqlalchemy import create_engine
import numpy as np

In [31]:
temp_db = create_engine('sqlite:///:memory:')

In [35]:
df = pd.DataFrame(data=np.random.randint(low=0, high=100, size=(4, 4)), columns=['a', 'b', 'c', 'd'])

In [36]:
df

    a   b   c   d
0  89  98  92  75
1  74  38  89  75
2  87  64  84  29
3  28   3  21   2

In [37]:
# Create a new table in db from dataframe
df.to_sql(name='new_table', con=temp_db, index=False)

In [39]:
# Cannot do two.
# Safeguard from overwriting data, can specify param to override it.
df.to_sql(name='new_table', con=temp_db)

ValueError: Table 'new_table' already exists.

In [40]:
# Let's read!
new_df = pd.read_sql(sql='new_table', con=temp_db)

In [42]:
new_df

   index   a   b   c   d
0      0  89  98  92  75
1      1  74  38  89  75
2      2  87  64  84  29
3      3  28   3  21   2

In [44]:
# Or pass in entire query!
pd.read_sql_query(sql='SELECT a, c FROM new_table;', con=temp_db) # Wow!

    a   c
0  89  92
1  74  89
2  87  84
3  28  21